[
    {
        "title": "",
        "image": "",
        "text": "With the rapid development of artificial intelligence (AI) technology, the application of AI in medicine is creating significant breakthroughs, particularly in supporting diagnosis and treatment. In Vietnam, where dermatological conditions, especially skin cancer, are increasingly prevalent, an advanced AI system has been developed to assist doctors and healthcare facilities in screening and diagnosing skin cancer. This system is designed with two main components: screening support and detailed diagnosis support."
    },
    {
        "title": "",
        "image": "assets/images/homes/image1.png",
        "text": ""
    },
    {
        "title": "1. Screening Support for Skin Cancer-Related Diseases",
        "image": "",
        "text": "The screening component of the AI system focuses on analyzing skin lesion images to distinguish three main condition groups:"
    },
    {
        "title": "",
        "image": "",
        "text": "- No Disease (Healthy Skin):\nThe system identifies normal skin conditions with no signs of dermatological abnormalities. This helps eliminate cases that do not require medical intervention, reducing the workload on healthcare facilities during initial screening."
    },
    {
        "title": "",
        "image": "",
        "text": "- Skin Cancer:\nThe system detects skin lesions suspected of being cancerous, marking cases that need early diagnosis and treatment. This is a crucial step in identifying high-risk patients for timely referral to specialists."
    },
    {
        "title": "",
        "image": "",
        "text": "- Other Diseases:\nThe system differentiates lesions that are not skin cancer but may indicate other dermatological conditions, such as dermatitis, skin infections, or benign lesions. This group also includes skin conditions that require treatment but are not as severe as cancer."
    },
    {
        "title": "",
        "image": "",
        "text": "The AI system utilizes deep learning technology, trained on hundreds of thousands of verified skin lesion images from dermatology experts. These algorithms analyze color, morphology, and other characteristics of skin lesions to provide accurate screening results:"
    },
    {
        "title": "",
        "image": "",
        "text": "1. Time-saving: Reduces screening time for doctors and healthcare workers.\n2. Improved accuracy: Minimizes missed cases or misdiagnoses.\n3. Enhanced healthcare access: Supports remote areas with limited specialist resources by using AI as a remote assistance tool."
    },
    {
        "title": "2. Detailed Diagnosis Support for Skin Cancer Types",
        "image": "",
        "text": "When the system detects a risk of skin cancer, it proceeds to a detailed diagnosis phase to identify the specific type of skin cancer the patient may have. This diagnostic component focuses on the three most common skin cancer types:"
    },
    {
        "title": "",
        "image": "",
        "text": "- Basal Cell Carcinoma (BCC):\nThis is the most common type of skin cancer, accounting for a high proportion of cases but typically growing slowly with low metastasis. The AI system analyzes typical lesion features such as irregular borders, pale or shiny areas. Early detection of this cancer type increases the success rate of treatment with minimally invasive methods."
    },
    {
        "title": "",
        "image": "",
        "text": "- Squamous Cell Carcinoma (SCC):\nThis cancer type progresses faster and has a higher risk of invasion compared to basal cell carcinoma. The AI system identifies characteristic features such as scaly lesions, ulcers, or thickened skin. Accurate diagnosis of this type helps doctors select appropriate treatments like surgery or radiation therapy."
    },
    {
        "title": "",
        "image": "",
        "text": "- Melanoma (MEL):\nThis is the most dangerous type of skin cancer, with a high risk of metastasis if not treated early. The AI system uses specialized algorithms to detect severe features such as inconsistent coloration, unclear borders, or rapid size changes in moles."
    },
    {
        "title": "",
        "image": "",
        "text": "Benefits of the diagnostic component:"
    },
    {
        "title": "",
        "image": "",
        "text": "1. Supports specialists: Provides detailed information to assist doctors in making more accurate diagnoses.\n2. Cost-saving: Reduces unnecessary testing by targeting the correct diagnostic focus.\n3. Increased survival rates: Early detection and treatment of dangerous cancers like melanoma improve patient survival chances."
    },
    {
        "title": "Conclusion",
        "image": "",
        "text": "The AI system for supporting skin cancer screening and diagnosis in Vietnam is a groundbreaking solution, particularly valuable in the context of limited healthcare resources. Integrating this system into medical processes not only enhances the quality of healthcare but also expands access to medical services for communities, especially in rural and remote areas. In the future, with continuous improvements, this system promises to become an indispensable tool in modern medicine."
    }
] 